MikroElektronika/core_packages/PIC/XC8/def/PIC16F916/mcu.h
extern volatile LCDDATA3bits_t LCDDATA3bits __at(0x113);
// bitfield macros
#define _LCDDATA3_SEG0_POSN                                 0x0
#define _LCDDATA3_SEG0_POSITION                             0x0
#define _LCDDATA3_SEG0_SIZE                                 0x1
#define _LCDDATA3_SEG0_LENGTH                               0x1
#define _LCDDATA3_SEG0_MASK                                 0x1
#define _LCDDATA3_SEG1_POSN                                 0x1
#define _LCDDATA3_SEG1_POSITION                             0x1
#define _LCDDATA3_SEG1_SIZE                                 0x1
#define _LCDDATA3_SEG1_LENGTH                               0x1
#define _LCDDATA3_SEG1_MASK                                 0x2
#define _LCDDATA3_SEG2_POSN                                 0x2
#define _LCDDATA3_SEG2_POSITION                             0x2
#define _LCDDATA3_SEG2_SIZE                                 0x1
#define _LCDDATA3_SEG2_LENGTH                               0x1
#define _LCDDATA3_SEG2_MASK                                 0x4
#define _LCDDATA3_SEG3_POSN                                 0x3
#define _LCDDATA3_SEG3_POSITION                             0x3
#define _LCDDATA3_SEG3_SIZE                                 0x1
#define _LCDDATA3_SEG3_LENGTH                               0x1
#define _LCDDATA3_SEG3_MASK                                 0x8
#define _LCDDATA3_SEG4_POSN                                 0x4
#define _LCDDATA3_SEG4_POSITION                             0x4
#define _LCDDATA3_SEG4_SIZE                                 0x1
#define _LCDDATA3_SEG4_LENGTH                               0x1
#define _LCDDATA3_SEG4_MASK                                 0x10
#define _LCDDATA3_SEG5_POSN                                 0x5
#define _LCDDATA3_SEG5_POSITION                             0x5
#define _LCDDATA3_SEG5_SIZE                                 0x1
#define _LCDDATA3_SEG5_LENGTH                               0x1
#define _LCDDATA3_SEG5_MASK                                 0x20
#define _LCDDATA3_SEG6_POSN                                 0x6
#define _LCDDATA3_SEG6_POSITION                             0x6
#define _LCDDATA3_SEG6_SIZE                                 0x1
#define _LCDDATA3_SEG6_LENGTH                               0x1
#define _LCDDATA3_SEG6_MASK                                 0x40
#define _LCDDATA3_SEG7_POSN                                 0x7
#define _LCDDATA3_SEG7_POSITION                             0x7
#define _LCDDATA3_SEG7_SIZE                                 0x1
#define _LCDDATA3_SEG7_LENGTH                               0x1
#define _LCDDATA3_SEG7_MASK                                 0x80
#define _LCDDATA3_SEG0COM1_POSN                             0x0
#define _LCDDATA3_SEG0COM1_POSITION                         0x0
#define _LCDDATA3_SEG0COM1_SIZE                             0x1
#define _LCDDATA3_SEG0COM1_LENGTH                           0x1
#define _LCDDATA3_SEG0COM1_MASK                             0x1
#define _LCDDATA3_SEG1COM1_POSN                             0x1
#define _LCDDATA3_SEG1COM1_POSITION                         0x1
#define _LCDDATA3_SEG1COM1_SIZE                             0x1
#define _LCDDATA3_SEG1COM1_LENGTH                           0x1
#define _LCDDATA3_SEG1COM1_MASK                             0x2
#define _LCDDATA3_SEG2COM1_POSN                             0x2
#define _LCDDATA3_SEG2COM1_POSITION                         0x2
#define _LCDDATA3_SEG2COM1_SIZE                             0x1
#define _LCDDATA3_SEG2COM1_LENGTH                           0x1
#define _LCDDATA3_SEG2COM1_MASK                             0x4
#define _LCDDATA3_SEG3COM1_POSN                             0x3
#define _LCDDATA3_SEG3COM1_POSITION                         0x3
#define _LCDDATA3_SEG3COM1_SIZE                             0x1
#define _LCDDATA3_SEG3COM1_LENGTH                           0x1
#define _LCDDATA3_SEG3COM1_MASK                             0x8
#define _LCDDATA3_SEG4COM1_POSN                             0x4
#define _LCDDATA3_SEG4COM1_POSITION                         0x4
#define _LCDDATA3_SEG4COM1_SIZE                             0x1
#define _LCDDATA3_SEG4COM1_LENGTH                           0x1
#define _LCDDATA3_SEG4COM1_MASK                             0x10
#define _LCDDATA3_SEG5COM1_POSN                             0x5
#define _LCDDATA3_SEG5COM1_POSITION                         0x5
#define _LCDDATA3_SEG5COM1_SIZE                             0x1
#define _LCDDATA3_SEG5COM1_LENGTH                           0x1
#define _LCDDATA3_SEG5COM1_MASK                             0x20
#define _LCDDATA3_SEG6COM1_POSN                             0x6
#define _LCDDATA3_SEG6COM1_POSITION                         0x6
#define _LCDDATA3_SEG6COM1_SIZE                             0x1
#define _LCDDATA3_SEG6COM1_LENGTH                           0x1
#define _LCDDATA3_SEG6COM1_MASK                             0x40
#define _LCDDATA3_SEG7COM1_POSN                             0x7
#define _LCDDATA3_SEG7COM1_POSITION                         0x7
#define _LCDDATA3_SEG7COM1_SIZE                             0x1
#define _LCDDATA3_SEG7COM1_LENGTH                           0x1
#define _LCDDATA3_SEG7COM1_MASK                             0x80
#define _LCDDATA3_S0C1_POSN                                 0x0
#define _LCDDATA3_S0C1_POSITION                             0x0
#define _LCDDATA3_S0C1_SIZE                                 0x1
#define _LCDDATA3_S0C1_LENGTH                               0x1
#define _LCDDATA3_S0C1_MASK                                 0x1
#define _LCDDATA3_S1C1_POSN                                 0x1
#define _LCDDATA3_S1C1_POSITION                             0x1
#define _LCDDATA3_S1C1_SIZE                                 0x1
#define _LCDDATA3_S1C1_LENGTH                               0x1
#define _LCDDATA3_S1C1_MASK                                 0x2
#define _LCDDATA3_S2C1_POSN                                 0x2
#define _LCDDATA3_S2C1_POSITION                             0x2
#define _LCDDATA3_S2C1_SIZE                                 0x1
#define _LCDDATA3_S2C1_LENGTH                               0x1
#define _LCDDATA3_S2C1_MASK                                 0x4
#define _LCDDATA3_S3C1_POSN                                 0x3
#define _LCDDATA3_S3C1_POSITION                             0x3
#define _LCDDATA3_S3C1_SIZE                                 0x1
#define _LCDDATA3_S3C1_LENGTH                               0x1
#define _LCDDATA3_S3C1_MASK                                 0x8
#define _LCDDATA3_S4C1_POSN                                 0x4
#define _LCDDATA3_S4C1_POSITION                             0x4
#define _LCDDATA3_S4C1_SIZE                                 0x1
#define _LCDDATA3_S4C1_LENGTH                               0x1
#define _LCDDATA3_S4C1_MASK                                 0x10
#define _LCDDATA3_S5C1_POSN                                 0x5
#define _LCDDATA3_S5C1_POSITION                             0x5
#define _LCDDATA3_S5C1_SIZE                                 0x1
#define _LCDDATA3_S5C1_LENGTH                               0x1
#define _LCDDATA3_S5C1_MASK                                 0x20
#define _LCDDATA3_S6C1_POSN                                 0x6
#define _LCDDATA3_S6C1_POSITION                             0x6
#define _LCDDATA3_S6C1_SIZE                                 0x1
#define _LCDDATA3_S6C1_LENGTH                               0x1
#define _LCDDATA3_S6C1_MASK                                 0x40
#define _LCDDATA3_S7C1_POSN                                 0x7
#define _LCDDATA3_S7C1_POSITION                             0x7
#define _LCDDATA3_S7C1_SIZE                                 0x1
#define _LCDDATA3_S7C1_LENGTH                               0x1
#define _LCDDATA3_S7C1_MASK                                 0x80

