MikroElektronika/core_packages/PIC/XC8/def/PIC16F916/mcu.h
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0x11A);
// bitfield macros
#define _LCDDATA10_SEG8_POSN                                0x0
#define _LCDDATA10_SEG8_POSITION                            0x0
#define _LCDDATA10_SEG8_SIZE                                0x1
#define _LCDDATA10_SEG8_LENGTH                              0x1
#define _LCDDATA10_SEG8_MASK                                0x1
#define _LCDDATA10_SEG9_POSN                                0x1
#define _LCDDATA10_SEG9_POSITION                            0x1
#define _LCDDATA10_SEG9_SIZE                                0x1
#define _LCDDATA10_SEG9_LENGTH                              0x1
#define _LCDDATA10_SEG9_MASK                                0x2
#define _LCDDATA10_SEG10_POSN                               0x2
#define _LCDDATA10_SEG10_POSITION                           0x2
#define _LCDDATA10_SEG10_SIZE                               0x1
#define _LCDDATA10_SEG10_LENGTH                             0x1
#define _LCDDATA10_SEG10_MASK                               0x4
#define _LCDDATA10_SEG11_POSN                               0x3
#define _LCDDATA10_SEG11_POSITION                           0x3
#define _LCDDATA10_SEG11_SIZE                               0x1
#define _LCDDATA10_SEG11_LENGTH                             0x1
#define _LCDDATA10_SEG11_MASK                               0x8
#define _LCDDATA10_SEG12_POSN                               0x4
#define _LCDDATA10_SEG12_POSITION                           0x4
#define _LCDDATA10_SEG12_SIZE                               0x1
#define _LCDDATA10_SEG12_LENGTH                             0x1
#define _LCDDATA10_SEG12_MASK                               0x10
#define _LCDDATA10_SEG13_POSN                               0x5
#define _LCDDATA10_SEG13_POSITION                           0x5
#define _LCDDATA10_SEG13_SIZE                               0x1
#define _LCDDATA10_SEG13_LENGTH                             0x1
#define _LCDDATA10_SEG13_MASK                               0x20
#define _LCDDATA10_SEG14_POSN                               0x6
#define _LCDDATA10_SEG14_POSITION                           0x6
#define _LCDDATA10_SEG14_SIZE                               0x1
#define _LCDDATA10_SEG14_LENGTH                             0x1
#define _LCDDATA10_SEG14_MASK                               0x40
#define _LCDDATA10_SEG15_POSN                               0x7
#define _LCDDATA10_SEG15_POSITION                           0x7
#define _LCDDATA10_SEG15_SIZE                               0x1
#define _LCDDATA10_SEG15_LENGTH                             0x1
#define _LCDDATA10_SEG15_MASK                               0x80
#define _LCDDATA10_SEG8COM3_POSN                            0x0
#define _LCDDATA10_SEG8COM3_POSITION                        0x0
#define _LCDDATA10_SEG8COM3_SIZE                            0x1
#define _LCDDATA10_SEG8COM3_LENGTH                          0x1
#define _LCDDATA10_SEG8COM3_MASK                            0x1
#define _LCDDATA10_SEG9COM3_POSN                            0x1
#define _LCDDATA10_SEG9COM3_POSITION                        0x1
#define _LCDDATA10_SEG9COM3_SIZE                            0x1
#define _LCDDATA10_SEG9COM3_LENGTH                          0x1
#define _LCDDATA10_SEG9COM3_MASK                            0x2
#define _LCDDATA10_SEG10COM3_POSN                           0x2
#define _LCDDATA10_SEG10COM3_POSITION                       0x2
#define _LCDDATA10_SEG10COM3_SIZE                           0x1
#define _LCDDATA10_SEG10COM3_LENGTH                         0x1
#define _LCDDATA10_SEG10COM3_MASK                           0x4
#define _LCDDATA10_SEG11COM3_POSN                           0x3
#define _LCDDATA10_SEG11COM3_POSITION                       0x3
#define _LCDDATA10_SEG11COM3_SIZE                           0x1
#define _LCDDATA10_SEG11COM3_LENGTH                         0x1
#define _LCDDATA10_SEG11COM3_MASK                           0x8
#define _LCDDATA10_SEG12COM3_POSN                           0x4
#define _LCDDATA10_SEG12COM3_POSITION                       0x4
#define _LCDDATA10_SEG12COM3_SIZE                           0x1
#define _LCDDATA10_SEG12COM3_LENGTH                         0x1
#define _LCDDATA10_SEG12COM3_MASK                           0x10
#define _LCDDATA10_SEG13COM3_POSN                           0x5
#define _LCDDATA10_SEG13COM3_POSITION                       0x5
#define _LCDDATA10_SEG13COM3_SIZE                           0x1
#define _LCDDATA10_SEG13COM3_LENGTH                         0x1
#define _LCDDATA10_SEG13COM3_MASK                           0x20
#define _LCDDATA10_SEG14COM3_POSN                           0x6
#define _LCDDATA10_SEG14COM3_POSITION                       0x6
#define _LCDDATA10_SEG14COM3_SIZE                           0x1
#define _LCDDATA10_SEG14COM3_LENGTH                         0x1
#define _LCDDATA10_SEG14COM3_MASK                           0x40
#define _LCDDATA10_SEG15COM3_POSN                           0x7
#define _LCDDATA10_SEG15COM3_POSITION                       0x7
#define _LCDDATA10_SEG15COM3_SIZE                           0x1
#define _LCDDATA10_SEG15COM3_LENGTH                         0x1
#define _LCDDATA10_SEG15COM3_MASK                           0x80
#define _LCDDATA10_S8C3_POSN                                0x0
#define _LCDDATA10_S8C3_POSITION                            0x0
#define _LCDDATA10_S8C3_SIZE                                0x1
#define _LCDDATA10_S8C3_LENGTH                              0x1
#define _LCDDATA10_S8C3_MASK                                0x1
#define _LCDDATA10_S9C3_POSN                                0x1
#define _LCDDATA10_S9C3_POSITION                            0x1
#define _LCDDATA10_S9C3_SIZE                                0x1
#define _LCDDATA10_S9C3_LENGTH                              0x1
#define _LCDDATA10_S9C3_MASK                                0x2
#define _LCDDATA10_S10C3_POSN                               0x2
#define _LCDDATA10_S10C3_POSITION                           0x2
#define _LCDDATA10_S10C3_SIZE                               0x1
#define _LCDDATA10_S10C3_LENGTH                             0x1
#define _LCDDATA10_S10C3_MASK                               0x4
#define _LCDDATA10_S11C3_POSN                               0x3
#define _LCDDATA10_S11C3_POSITION                           0x3
#define _LCDDATA10_S11C3_SIZE                               0x1
#define _LCDDATA10_S11C3_LENGTH                             0x1
#define _LCDDATA10_S11C3_MASK                               0x8
#define _LCDDATA10_S12C3_POSN                               0x4
#define _LCDDATA10_S12C3_POSITION                           0x4
#define _LCDDATA10_S12C3_SIZE                               0x1
#define _LCDDATA10_S12C3_LENGTH                             0x1
#define _LCDDATA10_S12C3_MASK                               0x10
#define _LCDDATA10_S13C3_POSN                               0x5
#define _LCDDATA10_S13C3_POSITION                           0x5
#define _LCDDATA10_S13C3_SIZE                               0x1
#define _LCDDATA10_S13C3_LENGTH                             0x1
#define _LCDDATA10_S13C3_MASK                               0x20
#define _LCDDATA10_S14C3_POSN                               0x6
#define _LCDDATA10_S14C3_POSITION                           0x6
#define _LCDDATA10_S14C3_SIZE                               0x1
#define _LCDDATA10_S14C3_LENGTH                             0x1
#define _LCDDATA10_S14C3_MASK                               0x40
#define _LCDDATA10_S15C3_POSN                               0x7
#define _LCDDATA10_S15C3_POSITION                           0x7
#define _LCDDATA10_S15C3_SIZE                               0x1
#define _LCDDATA10_S15C3_LENGTH                             0x1
#define _LCDDATA10_S15C3_MASK                               0x80

// Register: LCDSE0
#define LCDSE0 LCDSE0
extern volatile unsigned char           LCDSE0              __at(0x11C);
#ifndef _LIB_BUILD
asm("LCDSE0 equ 011Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG0                   :1;
        unsigned SEG1                   :1;
        unsigned SEG2                   :1;
        unsigned SEG3                   :1;
        unsigned SEG4                   :1;
        unsigned SEG5                   :1;
        unsigned SEG6                   :1;
        unsigned SEG7                   :1;
    };
    struct {
        unsigned SE0                    :1;
        unsigned SE1                    :1;
        unsigned SE2                    :1;
        unsigned SE3                    :1;
        unsigned SE4                    :1;
        unsigned SE5                    :1;
        unsigned SE6                    :1;
        unsigned SE7                    :1;
    };
    struct {
        unsigned SEGEN0                 :1;
        unsigned SEGEN1                 :1;
        unsigned SEGEN2                 :1;
        unsigned SEGEN3                 :1;
        unsigned SEGEN4                 :1;
        unsigned SEGEN5                 :1;
        unsigned SEGEN6                 :1;
        unsigned SEGEN7                 :1;
    };
} LCDSE0bits_t;
extern volatile LCDSE0bits_t LCDSE0bits __at(0x11C);
// bitfield macros
#define _LCDSE0_SEG0_POSN                                   0x0
#define _LCDSE0_SEG0_POSITION                               0x0
#define _LCDSE0_SEG0_SIZE                                   0x1
#define _LCDSE0_SEG0_LENGTH                                 0x1
#define _LCDSE0_SEG0_MASK                                   0x1
#define _LCDSE0_SEG1_POSN                                   0x1
#define _LCDSE0_SEG1_POSITION                               0x1
#define _LCDSE0_SEG1_SIZE                                   0x1
#define _LCDSE0_SEG1_LENGTH                                 0x1
#define _LCDSE0_SEG1_MASK                                   0x2
#define _LCDSE0_SEG2_POSN                                   0x2
#define _LCDSE0_SEG2_POSITION                               0x2
#define _LCDSE0_SEG2_SIZE                                   0x1
#define _LCDSE0_SEG2_LENGTH                                 0x1
#define _LCDSE0_SEG2_MASK                                   0x4
#define _LCDSE0_SEG3_POSN                                   0x3
#define _LCDSE0_SEG3_POSITION                               0x3
#define _LCDSE0_SEG3_SIZE                                   0x1
#define _LCDSE0_SEG3_LENGTH                                 0x1
#define _LCDSE0_SEG3_MASK                                   0x8
#define _LCDSE0_SEG4_POSN                                   0x4
#define _LCDSE0_SEG4_POSITION                               0x4
#define _LCDSE0_SEG4_SIZE                                   0x1
#define _LCDSE0_SEG4_LENGTH                                 0x1
#define _LCDSE0_SEG4_MASK                                   0x10
#define _LCDSE0_SEG5_POSN                                   0x5
#define _LCDSE0_SEG5_POSITION                               0x5
#define _LCDSE0_SEG5_SIZE                                   0x1
#define _LCDSE0_SEG5_LENGTH                                 0x1
#define _LCDSE0_SEG5_MASK                                   0x20
#define _LCDSE0_SEG6_POSN                                   0x6
#define _LCDSE0_SEG6_POSITION                               0x6
#define _LCDSE0_SEG6_SIZE                                   0x1
#define _LCDSE0_SEG6_LENGTH                                 0x1
#define _LCDSE0_SEG6_MASK                                   0x40
#define _LCDSE0_SEG7_POSN                                   0x7
#define _LCDSE0_SEG7_POSITION                               0x7
#define _LCDSE0_SEG7_SIZE                                   0x1
#define _LCDSE0_SEG7_LENGTH                                 0x1
#define _LCDSE0_SEG7_MASK                                   0x80
#define _LCDSE0_SE0_POSN                                    0x0
#define _LCDSE0_SE0_POSITION                                0x0
#define _LCDSE0_SE0_SIZE                                    0x1
#define _LCDSE0_SE0_LENGTH                                  0x1
#define _LCDSE0_SE0_MASK                                    0x1
#define _LCDSE0_SE1_POSN                                    0x1
#define _LCDSE0_SE1_POSITION                                0x1
#define _LCDSE0_SE1_SIZE                                    0x1
#define _LCDSE0_SE1_LENGTH                                  0x1
#define _LCDSE0_SE1_MASK                                    0x2
#define _LCDSE0_SE2_POSN                                    0x2
#define _LCDSE0_SE2_POSITION                                0x2
#define _LCDSE0_SE2_SIZE                                    0x1
#define _LCDSE0_SE2_LENGTH                                  0x1
#define _LCDSE0_SE2_MASK                                    0x4
#define _LCDSE0_SE3_POSN                                    0x3
#define _LCDSE0_SE3_POSITION                                0x3
#define _LCDSE0_SE3_SIZE                                    0x1
#define _LCDSE0_SE3_LENGTH                                  0x1
#define _LCDSE0_SE3_MASK                                    0x8
#define _LCDSE0_SE4_POSN                                    0x4
#define _LCDSE0_SE4_POSITION                                0x4
#define _LCDSE0_SE4_SIZE                                    0x1
#define _LCDSE0_SE4_LENGTH                                  0x1
#define _LCDSE0_SE4_MASK                                    0x10
#define _LCDSE0_SE5_POSN                                    0x5
#define _LCDSE0_SE5_POSITION                                0x5
#define _LCDSE0_SE5_SIZE                                    0x1
#define _LCDSE0_SE5_LENGTH                                  0x1
#define _LCDSE0_SE5_MASK                                    0x20
#define _LCDSE0_SE6_POSN                                    0x6
#define _LCDSE0_SE6_POSITION                                0x6
#define _LCDSE0_SE6_SIZE                                    0x1
#define _LCDSE0_SE6_LENGTH                                  0x1
#define _LCDSE0_SE6_MASK                                    0x40
#define _LCDSE0_SE7_POSN                                    0x7
#define _LCDSE0_SE7_POSITION                                0x7
#define _LCDSE0_SE7_SIZE                                    0x1
#define _LCDSE0_SE7_LENGTH                                  0x1
#define _LCDSE0_SE7_MASK                                    0x80
#define _LCDSE0_SEGEN0_POSN                                 0x0
#define _LCDSE0_SEGEN0_POSITION                             0x0
#define _LCDSE0_SEGEN0_SIZE                                 0x1
#define _LCDSE0_SEGEN0_LENGTH                               0x1
#define _LCDSE0_SEGEN0_MASK                                 0x1
#define _LCDSE0_SEGEN1_POSN                                 0x1
#define _LCDSE0_SEGEN1_POSITION                             0x1
#define _LCDSE0_SEGEN1_SIZE                                 0x1
#define _LCDSE0_SEGEN1_LENGTH                               0x1
#define _LCDSE0_SEGEN1_MASK                                 0x2
#define _LCDSE0_SEGEN2_POSN                                 0x2
#define _LCDSE0_SEGEN2_POSITION                             0x2
#define _LCDSE0_SEGEN2_SIZE                                 0x1
#define _LCDSE0_SEGEN2_LENGTH                               0x1
#define _LCDSE0_SEGEN2_MASK                                 0x4
#define _LCDSE0_SEGEN3_POSN                                 0x3
#define _LCDSE0_SEGEN3_POSITION                             0x3
#define _LCDSE0_SEGEN3_SIZE                                 0x1
#define _LCDSE0_SEGEN3_LENGTH                               0x1
#define _LCDSE0_SEGEN3_MASK                                 0x8
#define _LCDSE0_SEGEN4_POSN                                 0x4
#define _LCDSE0_SEGEN4_POSITION                             0x4
#define _LCDSE0_SEGEN4_SIZE                                 0x1
#define _LCDSE0_SEGEN4_LENGTH                               0x1
#define _LCDSE0_SEGEN4_MASK                                 0x10
#define _LCDSE0_SEGEN5_POSN                                 0x5
#define _LCDSE0_SEGEN5_POSITION                             0x5
#define _LCDSE0_SEGEN5_SIZE                                 0x1
#define _LCDSE0_SEGEN5_LENGTH                               0x1
#define _LCDSE0_SEGEN5_MASK                                 0x20
#define _LCDSE0_SEGEN6_POSN                                 0x6
#define _LCDSE0_SEGEN6_POSITION                             0x6
#define _LCDSE0_SEGEN6_SIZE                                 0x1
#define _LCDSE0_SEGEN6_LENGTH                               0x1
#define _LCDSE0_SEGEN6_MASK                                 0x40
#define _LCDSE0_SEGEN7_POSN                                 0x7
#define _LCDSE0_SEGEN7_POSITION                             0x7
#define _LCDSE0_SEGEN7_SIZE                                 0x1
#define _LCDSE0_SEGEN7_LENGTH                               0x1
#define _LCDSE0_SEGEN7_MASK                                 0x80

// Register: LCDSE1
#define LCDSE1 LCDSE1
extern volatile unsigned char           LCDSE1              __at(0x11D);
#ifndef _LIB_BUILD
asm("LCDSE1 equ 011Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SEG8                   :1;
        unsigned SEG9                   :1;
        unsigned SEG10                  :1;
        unsigned SEG11                  :1;
        unsigned SEG12                  :1;
        unsigned SEG13                  :1;
        unsigned SEG14                  :1;
        unsigned SEG15                  :1;
    };
    struct {
        unsigned SE8                    :1;
        unsigned SE9                    :1;
        unsigned SE10                   :1;
        unsigned SE11                   :1;
        unsigned SE12                   :1;
        unsigned SE13                   :1;
        unsigned SE14                   :1;
        unsigned SE15                   :1;
    };
    struct {
        unsigned SEGEN8                 :1;
        unsigned SEGEN9                 :1;
        unsigned SEGEN10                :1;
        unsigned SEGEN11                :1;
        unsigned SEGEN12                :1;
        unsigned SEGEN13                :1;
        unsigned SEGEN14                :1;
        unsigned SEGEN15                :1;
    };
} LCDSE1bits_t;
